<template>
  <section :class="$style.steps">
    <div class="container"
             :class="$style['steps__container']">
      <div :class="$style['steps__wrapp']">
        <VStep v-for="step in steps"
               :key="step.id"
               :content="step" :class="$style['space-circle']"/>
        <div>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import VStep from "@/components/main/VStep"

export default {
  name: "StepsBlock",
  components: {
    VStep,
  },
  data() {
    return {
      steps: [
        {
          id: '01',
          title: 'Регистрация',
          text: 'Чтобы отправить заявление на участие в онлайн-голосовании, пользователь должен подтвердить личность при помощи кода из СМС. Он придет на номер телефона, указанный в личном кабинете на mos.ru. Кроме того, о начале записи на электронное голосование, его старте и окончании можно будет узнать из уведомлений в личном кабинете на mos.ru и писем, которые придут на указанную в нем электронную почту. Такая процедура идентификации хорошо знакома каждому, кто хоть раз пользовался онлайн-приложениями банков или регистрировался в интернет-магазинах.',
          icon: 'IconRegistration',
        },
        {
          id: '02',
          title: 'Как приступить к голосованию',
          text: 'В дни голосования: 17-19 сентября 2021 года избиратель сможет попасть на страницу электронного голосования любым удобным для него способом: выбрав услугу в каталоге на mos.ru, кликнув на специальные баннеры, размещенные на mos.ru (в том числе в личном кабинете), перейдя по ссылке из СМС, электронной почты или уведомлений в личном кабинете.\n' +
              'Голосование будет доступно на mos.ru с 8:00 17 сентября до 20:00 19 сентября.',
          icon: 'IconCalendar',
          button: 'узнать больше',
        },
        {
          id: '03',
          title: 'Как открыть бюллетень',
          text: 'Получить электронный бланк для голосования можно по коду из СМС. Как только вы получаете бюллетень, ваше имя перестает существовать для системы.\n' +
              'Это происходит благодаря специальной программе-анонимайзеру. Теперь ни администраторам системы, ни наблюдателям не видно, кто и как голосует. В бюллетене нет ни персональных данных, ни порядкового номера, и в этом смысле его можно сравнить с обезличенным бланком ЕГЭ.\n' +
              'Электронный бюллетень нигде не хранится и существует только на экране избирателя.',
          icon: 'IconQuestion',
        },
      ],
    };
  },
}
</script>

<style lang="scss" module>
.steps {
  width: 100%;
  margin-top: 6rem;
  margin-bottom: 5rem;
  &__container {
    display: flex;
    align-items: center;
  }

  &__wrapp {
    width: 100%;
    & .space-circle {
      width: inherit;
    }
  }
}

</style>
